Steady_Airfoil_pos5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Side
    {
        type            empty;
//        physicalType    patch;
        nFaces          167894;
        startFace       167324;
    }
    Airfoil
    {
        type            wall;
//        physicalType    patch;
        nFaces          225;
        startFace       335218;
    }
    Inlet
    {
        type            patch;
//        physicalType    patch;
        nFaces          661;
        startFace       335443;
    }
    Outlet
    {
        type            patch;
//        physicalType    patch;
        nFaces          254;
        startFace       336104;
    }
)

// ************************************************************************* //
