Steady_Airfoil_pos5/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 4.17e-7; // set equal to eddy viscosity assuming 
                                  // a Prt = 1.

boundaryField
{

    Side
    {
        type            empty;
    }

    Outlet
    {
        type            zeroGradient;
    }

    Airfoil
    {
        type            compressible::alphatWallFunction;
	Prt		0.85;
        value           uniform 0;
    }

    Inlet
    {
        type            calculated;
        value           uniform 4.17e-7; // set equal to eddy viscosity assuming 
					  // a Prt = 1.
    }
}




// ************************************************************************* //
