Steady_Airfoil_pos5/system/fieldAverageDict
   fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so" );
        enabled         true;
        outputControl   outputTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
            rho
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
