Steady_Airfoil_pos5/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


 type   sets;
 libs   (sampling);
 writeControl   outputTime;
 writeInterval  1;
 interpolationScheme    cellPoint;
 setFormat      raw;
 sets
 (
        cp
        {
        type    patchCloud;
        axis    xyz;
	patches	(Airfoil);
	maxDistance 0.01;
        points  (#include coord.dat);
        interpolate     false; //true;
        }
 );
 fields (p);


















































































































































































































































































































































































































































































































































































































































// ************************************************************************* //
